Mrklly/source/knob_temp_ctrl_rf/stdlib/src/hc32_sysctrl.c
    setBit(&(M0P_SYSCTRL->PERI_CLKEN), enPeripheral, bFlag);
    
    return enRet;
}

/**
 *******************************************************************************
 ** \brief 获得外设时钟门控开关状态
 ** \param [in]  enPeripheral   目标外设
 ** \retval      TRUE           开
 **              FALSE          关
 ******************************************************************************/
boolean_t Sysctrl_GetPeripheralGate(en_sysctrl_peripheral_gate_t enPeripheral)
{       
    return getBit(&(M0P_SYSCTRL->PERI_CLKEN), enPeripheral);
}

/**
 *******************************************************************************
 ** \brief 系统功能设定
 ** \param [in]  enFunc     系统功能枚举类型
 ** \param [in]  bFlag      1-开/0-关
 ** \retval      Ok         设定成功
 **             其他        设定失败
 ******************************************************************************/
en_result_t Sysctrl_SetFunc(en_sysctrl_func_t enFunc, boolean_t bFlag)
{
    en_result_t enRet = Ok;
    
    _SysctrlUnlock();
    bFlag = !!bFlag;

    switch (enFunc)
    {
        case SysctrlWkupByRCHEn:
            M0P_SYSCTRL->SYSCTRL0_f.WAKEUP_BYRCH = bFlag;
            break;
        case SysctrlEXTHEn:
            M0P_SYSCTRL->SYSCTRL1_f.EXTH_EN = bFlag;
            break;
        case SysctrlEXTLEn:
            M0P_SYSCTRL->SYSCTRL1_f.EXTL_EN = bFlag;
            break;
        case SysctrlXTLAlwaysOnEn:
            M0P_SYSCTRL->SYSCTRL1_f.XTL_ALWAYS_ON = bFlag;
            break;
        case SysctrlClkFuncRTCLpmEn:
            M0P_SYSCTRL->SYSCTRL1_f.RTC_LPW = bFlag;
            break;
        case SysctrlCMLockUpEn:
            M0P_SYSCTRL->SYSCTRL1_f.LOCKUP_EN = bFlag;
            break;
        case SysctrlSWDUseIOEn:
            M0P_SYSCTRL->SYSCTRL1_f.SWD_USE_IO = bFlag;
            break;
        default:
            enRet = ErrorInvalidParameter;
            break;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief 设定RTC校准时钟频率
 ** \param [in]  enRtcAdj   校准频率值
 ** \retval      Ok         设定成功
 **             其他        设定失败
 ******************************************************************************/
en_result_t Sysctrl_SetRTCAdjustClkFreq(en_sysctrl_rtc_adjust_t enRtcAdj)
{
    en_result_t enRet = Ok;

    _SysctrlUnlock();
    M0P_SYSCTRL->SYSCTRL1_f.RTC_FREQ_ADJUST = enRtcAdj;

    return enRet;
}

//@} // SysctrlGroup

/*******************************************************************************
 * EOF (not truncated)
 ******************************************************************************/
